Бухгалтерия_обновление_тест1/src/AccumulationRegisters/ПрочиеРасходыНезавершенногоПроизводства/ПрочиеРасходыНезавершенногоПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрочиеРасходыНезавершенногоПроизводства</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРеглБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>НДСРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДоляСтоимости</name>
    <comment>Используется для ПУ 2.1</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьУпрБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПоказательОтнесенияНаВыпуск</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПоказательОтнесенияНаВыпускБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПоказательОтнесенияНаВыпускРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьПоказательОтнесенияНаВыпускУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродукции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаПродукции</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделУчета</name>
    <type>
      <types>EnumRef.РазделыУчетаСебестоимостиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИсточник</name>
    <type>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументВыпуска</name>
    <type>
      <types>DocumentRef.ОтчетПереработчика</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ПроизводствоБезЗаказа</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговоеНазначениеВыпуска</name>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОтнесенияНаПартию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОтнесенияНаПартиюБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОтнесенияНаПартиюРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОтнесенияНаПартиюУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаПартииВыпуска</name>
    <type>
      <types>CatalogRef.УдалитьКлючиАналитикиУчетаПартийПроизводства</types>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаУчетаПартий</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПартий</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОтнесенияНаПартиюРеглБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОтнесенияНаПартиюУпрБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОтнесенияНаПартиюНДСРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>23</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПартияПроизводства</name>
    <type>
      <types>CatalogRef.ПартииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПартияПроизводства</name>
    <type>
      <types>DefinedType.ДокументПартииПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.СписаниеЗатратНаВыпуск</types>
      <types>DocumentRef.ЗаказПереработчику</types>
      <types>CatalogRef.РесурсныеСпецификации</types>
      <types>DocumentRef.ВыпускПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтрокиПродукция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыПроизводства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПравилоОтнесенияНаВыпуск</name>
    <type>
      <types>EnumRef.ПравилаОтнесенияНаВыпуск</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговоеНазначение</name>
    <comment>Только для 2.1, в 2.5 не используется</comment>
    <type>
      <types>CatalogRef.НалоговыеНазначенияАктивовИЗатрат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Бухгалтерия_обновление_тест1/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НаборыУпаковок</owners>
  <attributes>
    <name>Безразмерная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладскаяГруппа</name>
    <type>
      <types>CatalogRef.СкладскиеГруппыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Типоразмер</name>
    <type>
      <types>CatalogRef.ТипоразмерыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставляетсяВМногооборотнойТаре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаМногооборотнаяТара</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоУпаковокМногооборотнойТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

Бухгалтерия_обновление_тест1/src/CommonModules/ПоступлениеОтПереработчикаЛокализация/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ Локализация
	МеханизмыДокумента.Добавить("РегламентированныйУчет");
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый документ.
//  Отказ - Булево - Признак проведения документа.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то проведение документа выполнено не будет.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то будет выполнен отказ от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//
Процедура ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//  РежимЗаписи - РежимЗаписиДокумента - В параметр передается текущий режим записи документа. Позволяет определить в теле процедуры режим записи.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина, то запись выполнена не будет и будет вызвано исключение.
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  ОбъектКопирования - ДокументОбъект.<Имя документа> - Исходный документ, который является источником копирования.
//
Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
КонецПроцедуры

// Добавляет команду создания документа "Авансовый отчет".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт


КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//++ Локализация

	// Приходный ордер (М-4)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьОбщихФорм";
	КомандаПечати.Идентификатор = "М4";
	КомандаПечати.Представление = НСтр("ru='Приходный ордер (М-4)';uk='Прибутковий ордер (М-4)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Функция получает данные для формирования печатной формы  М-4
Функция ПолучитьДанныеДляПечатнойФормыМ4(ПараметрыПечати, МассивОбъектов) Экспорт
	
	КолонкаКодов = ФормированиеПечатныхФорм.ИмяДополнительнойКолонки();
	Если Не ЗначениеЗаполнено(КолонкаКодов) Тогда
		КолонкаКодов = "Код";
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ДанныеДокументов.Ссылка  КАК Ссылка,
	|	ДанныеДокументов.Дата    КАК Дата,
	|	ДанныеДокументов.Валюта  КАК Валюта
	|
	|ПОМЕСТИТЬ ТаблицаДанныхДокументов
	|ИЗ
	|	Документ.ПоступлениеОтПереработчика КАК ДанныеДокументов
	|
	|ГДЕ
	|	ДанныеДокументов.Ссылка В (&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Запрос.Выполнить();
	
	ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц);
	
	Запрос.Текст = "
	|////////////////////////////////////////////////////////////////////////////
	|// ЗАПРОС ПО ШАПКЕ
	|
	|ВЫБРАТЬ
	|	ПоступлениеОтПереработчика.Ссылка                     КАК Ссылка,
	|	ПоступлениеОтПереработчика.Номер                      КАК Номер,
	|	ПоступлениеОтПереработчика.Дата                       КАК Дата,
	|	ПоступлениеОтПереработчика.Дата                       КАК ДатаСоставления,
	|	ПоступлениеОтПереработчика.НомерВходящегоДокумента    КАК НомерСопроводительногоДокумента,
	|	ПоступлениеОтПереработчика.Контрагент                 КАК Поставщик,
	|	ПоступлениеОтПереработчика.Организация                КАК Организация,
	|	ПоступлениеОтПереработчика.Организация.Префикс        КАК Префикс,
	|	ПоступлениеОтПереработчика.БанковскийСчетОрганизации  КАК БанковскийСчетОрганизации,
	|
	|	ВЫБОР
	|		КОГДА
	|			ПоступлениеОтПереработчика.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		ТОГДА
	|			ПоступлениеОтПереработчика.Организация
	|		ИНАЧЕ
	|			ПоступлениеОтПереработчика.Грузоотправитель
	|	КОНЕЦ                                                 КАК Грузоотправитель,
	|
	|	ПоступлениеОтПереработчика.Подразделение              КАК Подразделение,
	|	ПоступлениеОтПереработчика.Подразделение.Наименование КАК ПредставлениеПодразделения,
	|	ПоступлениеОтПереработчика.Валюта                     КАК Валюта,
	|	ПоступлениеОтПереработчика.Принял        			  КАК МОЛ,
	|	ПоступлениеОтПереработчика.ПринялДолжность            КАК ДолжностьМОЛ
	|
	|ИЗ
	|	Документ.ПоступлениеОтПереработчика КАК ПоступлениеОтПереработчика
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаДанныхДокументов КАК ДанныеДокументов
	|	ПО
	|		ПоступлениеОтПереработчика.Ссылка = ДанныеДокументов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|// ЗАПРОС ПО ТАБЛИЧНЫМ ЧАСТЯМ
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.Ссылка                                  КАК Ссылка,
	|	ТаблицаТоваров.Склад                                   КАК Склад,
	|	ТаблицаТоваров.Склад.Наименование                      КАК СкладНаименование,
	|	ТаблицаТоваров.Номенклатура                            КАК Номенклатура,
	|	ТаблицаТоваров.Номенклатура.НаименованиеПолное         КАК ТоварНаименование,
	|	
	|	ВЫБОР КОГДА &КолонкаКодов = ""Артикул"" ТОГДА
	|		ТаблицаТоваров.Номенклатура.Артикул
	|	ИНАЧЕ
	|		ТаблицаТоваров.Номенклатура.Код
	|	КОНЕЦ                                                  КАК ТоварКод,
	|	
	|	ТаблицаТоваров.ЕдиницаИзмерения.Представление          КАК ЕдиницаИзмеренияНаименование,
	|	ТаблицаТоваров.ЕдиницаИзмерения.Код                    КАК ЕдиницаИзмеренияКод,
	|	ТаблицаТоваров.Характеристика.НаименованиеПолное       КАК Характеристика,
	|
	|	ВЫБОР КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) = 1 ТОГДА
	|		НЕОПРЕДЕЛЕНО
	|	ИНАЧЕ
	|		ТаблицаТоваров.Упаковка
	|	КОНЕЦ                                                  КАК Упаковка,
	|
	|	ТаблицаТоваров.КоличествоУпаковок                      КАК Количество,
	|	ТаблицаТоваров.КоличествоУпаковок                      КАК КоличествоПринято,
	|	ВЫБОР КОГДА ТаблицаТоваров.Количество <> 0 ТОГДА 
	|		ТаблицаТоваров.СуммаБезНДС / ТаблицаТоваров.КоличествоУпаковок
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ                                                  КАК Цена,
	|	ТаблицаТоваров.СуммаБезНДС                             КАК СуммаБезНДС,
	|	ТаблицаТоваров.СуммаНДС                                КАК СуммаНДС,
	|	ТаблицаТоваров.СуммаБезНДС + ТаблицаТоваров.СуммаНДС   КАК СуммаСНДС,
	|	ЛОЖЬ                                                   КАК ЭтоВозвратнаяТара
	|
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ТаблицаТоваров.НомерСтроки
	|
	|ИТОГИ ПО
	|	Ссылка, Склад
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ТаблицаТоваров.Упаковка",
			"ТаблицаТоваров.Номенклатура"));
	Запрос.УстановитьПараметр("КолонкаКодов", КолонкаКодов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Возврат Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти", МассивРезультатов[0], МассивРезультатов[1]);
	
КонецФункции   


// Формирует временную таблицу, содержащую табличную часть по таблице данных документов.
//
// Параметры:
//	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер временных таблиц, содержащий таблицу ТаблицаДанныхДокументов с полями:
//		Ссылка,
//		Валюта.
//
//	ПересчитыватьВВалютуРегл - Булево - Признак необходимости пересчета сумм табличной части в валюте регламентированного учета.
//
Процедура ПоместитьВременнуюТаблицуТоваров(МенеджерВременныхТаблиц, ПересчитыватьВВалютуРегл = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("ПересчитыватьВВалютуРегл",       ПересчитыватьВВалютуРегл);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка             КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки        КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура       КАК Номенклатура,
	|	ТаблицаДокумента.Характеристика     КАК Характеристика,
	|	ТаблицаДокумента.Количество         КАК Количество,
	|	ТаблицаДокумента.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ДанныеДокументов.Валюта = &ВалютаРегламентированногоУчета
	|			ИЛИ НЕ &ПересчитыватьВВалютуРегл
	|			ТОГДА 0
	|		КОГДА ДанныеДокументов.Валюта <> &ВалютаРегламентированногоУчета
	|			И &ПересчитыватьВВалютуРегл
	|			ТОГДА ЕСТЬNULL(СуммыДокументовВВалютахУчета.СуммаБезНДСРегл, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ                               КАК СуммаБезНДС,
	|	НЕОПРЕДЕЛЕНО                        КАК СтавкаНДС,
	|	0                                   КАК СуммаНДС,
	|	ТаблицаДокумента.Упаковка           КАК Упаковка,
	|
	|	&ТекстЗапросаЕдиницаИзмерения       КАК ЕдиницаИзмерения,
	|
	|	ТаблицаДокумента.Склад              КАК Склад
	|
	|ПОМЕСТИТЬ ТаблицаТоваров
	|ИЗ
	|	Документ.ПоступлениеОтПереработчика.Товары КАК ТаблицаДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаДанныхДокументов КАК ДанныеДокументов
	|	ПО
	|		ТаблицаДокумента.Ссылка = ДанныеДокументов.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютахУчета КАК СуммыДокументовВВалютахУчета
	|	ПО
	|		ТаблицаДокумента.Ссылка = СуммыДокументовВВалютахУчета.Регистратор
	|		И ТаблицаДокумента.ИдентификаторСтроки = СуммыДокументовВВалютахУчета.ИдентификаторСтроки
	|		И СуммыДокументовВВалютахУчета.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка             КАК Ссылка,
	|	ТаблицаДокумента.НомерСтроки        КАК НомерСтроки,
	|	ТаблицаДокумента.Номенклатура       КАК Номенклатура,
	|	ТаблицаДокумента.Характеристика     КАК Характеристика,
	|	ТаблицаДокумента.Количество         КАК Количество,
	|	ТаблицаДокумента.КоличествоУпаковок КАК КоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ДанныеДокументов.Валюта = &ВалютаРегламентированногоУчета
	|			ИЛИ НЕ &ПересчитыватьВВалютуРегл
	|			ТОГДА ТаблицаДокумента.Сумма
	|		КОГДА ДанныеДокументов.Валюта <> &ВалютаРегламентированногоУчета
	|			И &ПересчитыватьВВалютуРегл
	|			ТОГДА ЕСТЬNULL(СуммыДокументовВВалютахУчета.СуммаБезНДСРегл, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ                               КАК СуммаБезНДС,
	|	НЕОПРЕДЕЛЕНО                        КАК СтавкаНДС,
	|	0                                   КАК СуммаНДС,
	|	ТаблицаДокумента.Упаковка           КАК Упаковка,
	|
	|	&ТекстЗапросаЕдиницаИзмерения       КАК ЕдиницаИзмерения,
	|
	|	ТаблицаДокумента.Склад              КАК Склад
	|
	|ИЗ
	|	Документ.ПоступлениеОтПереработчика.ВозвратныеОтходы КАК ТаблицаДокумента
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ТаблицаДанныхДокументов КАК ДанныеДокументов
	|	ПО
	|		ТаблицаДокумента.Ссылка = ДанныеДокументов.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.СуммыДокументовВВалютахУчета КАК СуммыДокументовВВалютахУчета
	|	ПО
	|		ТаблицаДокумента.Ссылка = СуммыДокументовВВалютахУчета.Регистратор
	|		И ТаблицаДокумента.ИдентификаторСтроки = СуммыДокументовВВалютахУчета.ИдентификаторСтроки
	|		И СуммыДокументовВВалютахУчета.Активность
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаЕдиницаИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Ссылка",
			"ТаблицаДокумента.Упаковка",
			"ТаблицаДокумента.Номенклатура"));
	
	Запрос.Выполнить();
	
КонецПроцедуры

//-- Локализация
#КонецОбласти

//++ НЕ УТ
#Область ПроводкиРегУчета

// Функция возвращает текст запроса для отражения документа в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстОтраженияВРеглУчете() Экспорт
	
	//++ Локализация
	Возврат ТекстОтраженияВРеглУчетеУКР(); 
	//-- Локализация
	Возврат "";
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц,
// необходимых для отражения в регламентированном учете
//
// Возвращаемое значение:
//   Строка - сформированный текст запроса.
//
Функция ТекстЗапросаВТОтраженияВРеглУчете() Экспорт
	
	//++ Локализация
	Возврат ТекстЗапросаВТОтраженияВРеглУчетеУКР();
	//-- Локализация
	Возврат "";
	
КонецФункции

#КонецОбласти
//-- НЕ УТ

//++ НЕ УТ
#Область ПроводкиРегУчетаУКР

// Функция возвращает текст запроса для отражения документа в регламентированном учете.
//
// Возвращаемое значение:
//	Строка - Текст запроса
//
Функция ТекстОтраженияВРеглУчетеУКР() Экспорт
	
	//++ Локализация

	ЯзыкСодержания = МультиязычностьУкр.КодЯзыкаИнформационнойБазы();
	
#Область ТекстОтраженияПоступлениеСобственныхТоваровПервичные21 
	ТекстОтраженияПоступлениеСобственныхТоваровПервичные21 = "
	|ВЫБРАТЬ // Выпуск собственной продукции Дт 25, 26 :: Кт 2
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата        КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО         КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Стоимости.Сумма, Строки.Сумма) КАК Сумма,
	|	ЕСТЬNULL(Стоимости.СуммаУУ, Строки.СуммаУУ) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе) КАК ВидСчетаДт,
	|	Строки.ГруппаФинансовогоУчета                       КАК АналитикаУчетаДт,
	|	Строки.Склад                                        КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)       КАК ВалютаДт,
	|	Строки.Склад.Подразделение                     КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности                 КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.Склад        КАК СубконтоДт1,
	|	Строки.Номенклатура КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО        КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	Строки.Количество КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО											КАК АналитикаУчетаКт,
	|	Операция.Партнер                                        КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО                                   КАК ВалютаКт,
	|	Операция.Подразделение                         КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА Операция.УчетСырьяПоНазначениям
	|			ТОГДА Строки.НаправлениеДеятельности
	|		ИНАЧЕ Операция.НаправлениеДеятельности
	|	КОНЕЦ                                          КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СубконтоКт1,
	|	Строки.ГруппаПродукции                         КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО                                   КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""%1"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеОтПереработчика КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтроки КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|		И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И Строки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаСкладах)
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ВтСтоимости КАК Стоимости
	|	ПО
	|		Строки.Ссылка = Стоимости.Ссылка
	|		И Строки.ВидДвижения = Стоимости.ВидДвижения
	|		И Строки.РазделУчета = Стоимости.РазделУчета
	|		И Строки.Номенклатура = Стоимости.Номенклатура
	|		И Строки.Склад = Стоимости.Склад
	|		И Строки.ГруппаФинансовогоУчета = Стоимости.ГруппаФинансовогоУчета
	|		И Строки.ТипЗапасов = Стоимости.ТипЗапасов
	|		И Строки.Контрагент = Стоимости.Контрагент
	|		И Строки.КорНоменклатура = Стоимости.КорНоменклатура
	|		И Строки.КорСклад = Стоимости.КорСклад
	|		И Строки.ГруппаПродукции = Стоимости.ГруппаПродукции
	|		И Строки.КорГруппаПродукции = Стоимости.КорГруппаПродукции
	|		И Строки.КорГруппаФинансовогоУчета = Стоимости.КорГруппаФинансовогоУчета
	|		И Строки.ХозяйственнаяОперация = Стоимости.ХозяйственнаяОперация
	|
	|ГДЕ
	|	(НЕ &ПартионныйУчетВерсии22
	|		ИЛИ Операция.Дата < &ДатаПереходаНаПартионныйУчетВерсии22)
	|	И Строки.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар)
	|	И НЕ Строки.Количество = 0
	|";   

	ТекстОтраженияПоступлениеСобственныхТоваровПервичные21 = СтрШаблон(ТекстОтраженияПоступлениеСобственныхТоваровПервичные21, 
		НСтр("ru='Выпуск собственной продукции';uk='Випуск власної продукції'",ЯзыкСодержания));

#КонецОбласти

#Область ТекстОтраженияПоступлениеСобственныхТоваровПервичные  
	ТекстОтраженияПоступлениеСобственныхТоваровПервичные = "
	|ВЫБРАТЬ // Выпуск собственной продукции (Дт 25, 26 :: Кт 2)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата        КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО         КАК ИдентификаторСтроки,
	|
	|	Строки.Сумма КАК Сумма,
	|	Строки.СуммаУУ КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе) КАК ВидСчетаДт,
	|	Строки.КорГруппаФинансовогоУчета                    КАК АналитикаУчетаДт,
	|	Строки.КорСклад                                     КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)       КАК ВалютаДт,
	|	Строки.КорСклад.Подразделение                  КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности              КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСклад        КАК СубконтоДт1,
	|	Строки.КорНоменклатура КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО           КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	Строки.Количество КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО											КАК АналитикаУчетаКт,
	|	Операция.Партнер                                        КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО                                   КАК ВалютаКт,
	|	Операция.Подразделение                         КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА Операция.УчетСырьяПоНазначениям
	|			ТОГДА Строки.НаправлениеДеятельности
	|		ИНАЧЕ Операция.НаправлениеДеятельности
	|	КОНЕЦ                                          КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СубконтоКт1,
	|	Строки.ГруппаПродукции                         КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО                                   КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""%1"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеОтПереработчика КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтроки КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|		И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|	И Операция.Дата >= &ДатаПереходаНаПартионныйУчетВерсии22
	|	И НЕ ЕСТЬNULL(Строки.КорСклад.ЦеховаяКладовая, ЛОЖЬ)
	|	И НЕ Строки.Количество = 0
	|";   

	ТекстОтраженияПоступлениеСобственныхТоваровПервичные = СтрШаблон(ТекстОтраженияПоступлениеСобственныхТоваровПервичные, 
		НСтр("ru='Выпуск собственной продукции';uk='Випуск власної продукції'",ЯзыкСодержания));

#КонецОбласти

#Область ТекстОтраженияПоступлениеСобственныхТоваровРасчетные 
	ТекстОтраженияПоступлениеСобственныхТоваровРасчетные = "
	|ВЫБРАТЬ // Выпуск собственной продукции (Дт 25, 26 :: Кт 2)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата        КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО         КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Стоимости.Сумма, Строки.Сумма) КАК Сумма,
	|	ЕСТЬNULL(Стоимости.СуммаУУ, Строки.СуммаУУ) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе) КАК ВидСчетаДт,
	|	Строки.КорГруппаФинансовогоУчета                    КАК АналитикаУчетаДт,
	|	Строки.КорСклад                                     КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)       КАК ВалютаДт,
	|	Строки.КорСклад.Подразделение                  КАК ПодразделениеДт,
	|	ЕСТЬNULL(Строки.КорНаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	Строки.КорСклад        КАК СубконтоДт1,
	|	Строки.КорНоменклатура КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО           КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство)      КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО												 КАК АналитикаУчетаКт,
	|	Операция.Партнер                                             КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО                                   КАК ВалютаКт,
	|	Операция.Подразделение                         КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА Операция.УчетСырьяПоНазначениям
	|			ТОГДА Стоимости.НаправлениеДеятельности
	|		ИНАЧЕ Операция.НаправлениеДеятельности
	|	КОНЕЦ                                          КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СубконтоКт1,
	|	Стоимости.ГруппаПродукции                      КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО                                   КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""%1"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеОтПереработчика КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтроки КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|		И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтоимости КАК Стоимости
	|	ПО
	|		Строки.Ссылка                        = Стоимости.Ссылка
	|		И Строки.Номенклатура                = Стоимости.Номенклатура
	|		И Строки.КорНоменклатура             = Стоимости.КорНоменклатура
	|		И Строки.Склад                       = Стоимости.Склад
	|		И Строки.КорСклад                    = Стоимости.КорСклад
	|		И Строки.ГруппаПродукции             = Стоимости.ГруппаПродукции
	|		И Строки.КорГруппаПродукции          = Стоимости.КорГруппаПродукции
	|		И Строки.ГруппаФинансовогоУчета      = Стоимости.ГруппаФинансовогоУчета
	|		И Строки.КорГруппаФинансовогоУчета   = Стоимости.КорГруппаФинансовогоУчета
	|		И Строки.НаправлениеДеятельности     = Стоимости.НаправлениеДеятельности
	|		И Строки.КорНаправлениеДеятельности  = Стоимости.КорНаправлениеДеятельности
	|		И Строки.ВидДвижения                 = Стоимости.ВидДвижения
	|		И Строки.ИдентификаторСтроки         = Стоимости.ИдентификаторСтроки
	|
	|ГДЕ
	|	НЕ ЕСТЬNULL(Строки.КорСклад.ЦеховаяКладовая, ЛОЖЬ)
	|"; 

	ТекстОтраженияПоступлениеСобственныхТоваровРасчетные = СтрШаблон(ТекстОтраженияПоступлениеСобственныхТоваровРасчетные, 
		НСтр("ru='Выпуск собственной продукции';uk='Випуск власної продукції'",ЯзыкСодержания));

#КонецОбласти

#Область ТекстОтраженияПоступлениеСобственныхТоваровСкладПроизводства 
	ТекстОтраженияПоступлениеСобственныхТоваровСкладПроизводства = "
	|ВЫБРАТЬ // Выпуск собственной продукции на склад производства (Дт 23 :: Кт 23)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата        КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО         КАК ИдентификаторСтроки,
	|
	|	ЕСТЬNULL(Стоимости.Сумма, Строки.Сумма) КАК Сумма,
	|	ЕСТЬNULL(Стоимости.СуммаУУ, Строки.СуммаУУ) КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	ЕСТЬNULL(Строки.КорСклад.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)       КАК ВалютаДт,
	|	ЕСТЬNULL(Строки.КорСклад.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности              КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.МатериальныеЗатраты) КАК СубконтоДт1,
	|	Строки.КорНоменклатура КАК СубконтоДт2,
	|	Строки.КорГруппаПродукции КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО											КАК АналитикаУчетаКт,
	|	Операция.Партнер                                        КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО                                   КАК ВалютаКт,
	|	Операция.Подразделение                         КАК ПодразделениеКт,
	|	ВЫБОР
	|		КОГДА Операция.УчетСырьяПоНазначениям
	|			ТОГДА ЕСТЬNULL(Стоимости.НаправлениеДеятельности, Строки.НаправлениеДеятельности)
	|		ИНАЧЕ Операция.НаправлениеДеятельности
	|	КОНЕЦ                                          КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СубконтоКт1,
	|	ЕСТЬNULL(Стоимости.ГруппаПродукции, Строки.ГруппаПродукции) КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО                                   КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""%1"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеОтПереработчика КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтроки КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|		И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтоимости КАК Стоимости
	|	ПО
	|		Строки.Ссылка                       = Стоимости.Ссылка
	|		И Строки.Номенклатура               = Стоимости.Номенклатура
	|		И Строки.Склад                      = Стоимости.Склад
	|		И Строки.ГруппаФинансовогоУчета     = Стоимости.ГруппаФинансовогоУчета
	|		И Строки.НаправлениеДеятельности    = Стоимости.НаправлениеДеятельности
	|		И Строки.ВидДвижения                = Стоимости.ВидДвижения
	|		И Строки.ГруппаПродукции            = Стоимости.ГруппаПродукции
	|		И Строки.КорНоменклатура            = Стоимости.КорНоменклатура
	|		И Строки.КорСклад                   = Стоимости.КорСклад
	|		И Строки.КорГруппаФинансовогоУчета  = Стоимости.КорГруппаФинансовогоУчета
	|		И Строки.КорГруппаПродукции         = Стоимости.КорГруппаПродукции
	|		И Строки.КорНаправлениеДеятельности = Стоимости.КорНаправлениеДеятельности
	|		И Строки.ИдентификаторСтроки        = Стоимости.ИдентификаторСтроки
	|		И Строки.АналитикаРасходов          = Стоимости.АналитикаРасходов
	|		И Строки.СтатьяРасходов             = Стоимости.СтатьяРасходов
	|		И Строки.АналитикаДоходов           = Стоимости.АналитикаДоходов
	|		И Строки.СтатьяДоходов              = Стоимости.СтатьяДоходов
	|		И Строки.АналитикаАктивовПассивов   = Стоимости.АналитикаАктивовПассивов
	|		И Строки.СтатьяАктивовПассивов      = Стоимости.СтатьяАктивовПассивов
	|
	|ГДЕ
	|	ЕСТЬNULL(Строки.КорСклад.ЦеховаяКладовая, ЛОЖЬ)
	|	И Строки.Количество > 0
	|	И НЕ (Строки.НаправлениеДеятельности = Строки.КорНаправлениеДеятельности
	|		  И Строки.ГруппаПродукции       = Строки.КорГруппаПродукции
	|		  И Строки.Подразделение         = ЕСТЬNULL(Строки.КорСклад.Подразделение, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)))
	|";   

	ТекстОтраженияПоступлениеСобственныхТоваровСкладПроизводства = СтрШаблон(ТекстОтраженияПоступлениеСобственныхТоваровСкладПроизводства, 
		НСтр("ru='Выпуск собственной продукции';uk='Випуск власної продукції'",ЯзыкСодержания));

#КонецОбласти

#Область ТекстОтраженияПоступлениеТоваровНематериальныеЗатраты 
	ТекстОтраженияПоступлениеТоваровНематериальныеЗатраты =
	// Выпуск собственной продукции, приход нематериальных затрат (Дт 2 :: Кт 23).
	"ВЫБРАТЬ
	|
	|	НематериальныеЗатраты.Ссылка КАК Ссылка,
	|	НематериальныеЗатраты.Период КАК Период,
	|	НематериальныеЗатраты.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО КАК ИдентификаторСтроки,
	|
	|	НематериальныеЗатраты.Сумма КАК Сумма,
	|	НематериальныеЗатраты.СуммаУпр КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе) КАК ВидСчетаДт,
	|	НематериальныеЗатраты.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	НематериальныеЗатраты.МестоУчетаДт КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)         КАК ВалютаДт,
	|	НематериальныеЗатраты.ПодразделениеДт            КАК ПодразделениеДт,
	|	НематериальныеЗатраты.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	НематериальныеЗатраты.МестоУчетаДт КАК СубконтоДт1,
	|	НематериальныеЗатраты.Продукция    КАК СубконтоДт2,
	|	НЕОПРЕДЕЛЕНО                       КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО											КАК АналитикаУчетаКт,
	|	НематериальныеЗатраты.ПодразделениеКт					КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаКт,
	|	НематериальныеЗатраты.ПодразделениеКт КАК ПодразделениеКт,
	|	НематериальныеЗатраты.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетКт,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СубконтоКт1,
	|	НематериальныеЗатраты.ГруппаПродукцииКт КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО                            КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""%1"" КАК Содержание
	|ИЗ
	|	НематериальныеЗатраты КАК НематериальныеЗатраты
	|";    

	ТекстОтраженияПоступлениеТоваровНематериальныеЗатраты = СтрШаблон(ТекстОтраженияПоступлениеТоваровНематериальныеЗатраты, 
		НСтр("ru='Выпуск собственной продукции';uk='Випуск власної продукції'",ЯзыкСодержания));

#КонецОбласти

#Область ТекстОтраженияПоступлениеТоваровДавальца
	ТекстОтраженияПоступлениеТоваровДавальца = "
	|ВЫБРАТЬ //// Выпуск продукции давальца (Дт 023 :: Кт )
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата        КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО         КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦнаскладах) КАК ВидСчетаДт,
	|	Строки.Номенклатура.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	Операция.Склад КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО                                                         КАК ВалютаДт,
	|	Операция.Склад.Подразделение                                         КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)            КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|	Строки.ВидЗапасов.Контрагент                                         КАК СубконтоДт1,
	|	Строки.Номенклатура                                                  КАК СубконтоДт2,
	|	Операция.Склад                                                       КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	Строки.Количество КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
 	|	""%1"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеОтПереработчика КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеОтПереработчика.Товары КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|ГДЕ
	|	Строки.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ //// Выпуск продукции давальца (Дт 002 :: Кт )
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата        КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО         КАК ИдентификаторСтроки,
	|
	|	0 КАК Сумма,
	|	0 КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦнаскладах) КАК ВидСчетаДт,
	|	Строки.Номенклатура.ГруппаФинансовогоУчета КАК АналитикаУчетаДт,
	|	Операция.Склад КАК МестоУчетаДт,
	|
	|	НЕОПРЕДЕЛЕНО                                                         КАК ВалютаДт,
	|	Операция.Склад.Подразделение                                         КАК ПодразделениеДт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)            КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетДт,
	|	Строки.ВидЗапасов.Контрагент                                         КАК СубконтоДт1,
	|	Строки.Номенклатура                                                  КАК СубконтоДт2,
	|	Операция.Склад                                                       КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	Строки.Количество КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	НЕОПРЕДЕЛЕНО КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК МестоУчетаКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК ВалютаКт,
	|	НЕОПРЕДЕЛЕНО КАК ПодразделениеКт,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|
	|	НЕОПРЕДЕЛЕНО КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	|	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
 	|	""%1"" КАК Содержание
	|
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеОтПереработчика КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеОтПереработчика.ВозвратныеОтходы КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|
	|ГДЕ
	|	Строки.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПродукцияДавальца)
	|";    

	ТекстОтраженияПоступлениеТоваровДавальца = СтрШаблон(ТекстОтраженияПоступлениеТоваровДавальца, 
		НСтр("ru='Выпуск продукции давальца';uk='Випуск продукції давальца'",ЯзыкСодержания));

#КонецОбласти


#Область ВключениеУслуги 
	ТекстОтраженияУслугиПереработчика = "
	|ВЫБРАТЬ //// Поступление услуг (Дт 23 :: Кт 23)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата		 КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО		 КАК ИдентификаторСтроки,
	|
	|	Строки.Сумма КАК Сумма,
	|	Строки.СуммаУУ КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	ЕСТЬNULL(Строки.КорСклад, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	ЕСТЬNULL(Строки.КорСклад, ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК ПодразделениеДт,
	|	Строки.КорНаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.Прочее) КАК СубконтоДт1,
	|	Строки.КорНоменклатура КАК СубконтоДт2,
	|	Строки.КорГруппаПродукции КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	Строки.Склад КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)	КАК ВалютаКт,
	|	Строки.Склад КАК ПодразделениеКт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|
	|	НЕОПРЕДЕЛЕНО					КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО					КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО					КАК СубконтоКт2,
	|	Строки.ГруппаПродукции			КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
	|	""%1"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеОтПереработчика КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтроки КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|		И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И Строки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|
	|ГДЕ
	|	(НЕ &ПартионныйУчетВерсии22
	|		ИЛИ Операция.Дата < &ДатаПереходаНаПартионныйУчетВерсии22)
	|	И Строки.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка))
	|	И (Строки.ГруппаПродукции <> Строки.КорГруппаПродукции
	|	ИЛИ Строки.НаправлениеДеятельности <> Строки.КорНаправлениеДеятельности)
	|";         

	ТекстОтраженияУслугиПереработчика = СтрШаблон(ТекстОтраженияУслугиПереработчика, 
		НСтр("ru='Услуга по переработке';uk='Послуга з переробки'",ЯзыкСодержания));

#КонецОбласти

#Область ПереквалификацияВозвратныхОтходов
	ТекстОтраженияПереквалификацииВозвратныхОтходов = "
	|ВЫБРАТЬ //// ПереквалификацияВозвратныхОтходов (Дт 23 :: Кт 23)
	|
	|	Операция.Ссылка КАК Ссылка,
	|	Операция.Дата		 КАК Период,
	|	Операция.Организация КАК Организация,
	|	НЕОПРЕДЕЛЕНО		 КАК ИдентификаторСтроки,
	|
	|	-Стоимости.Сумма КАК Сумма,
	|	-Стоимости.СуммаУУ КАК СуммаУУ,
	|
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчетаДт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаДт,
	|	Операция.Партнер КАК МестоУчетаДт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаДт,
	|	Операция.Подразделение КАК ПодразделениеДт,
	|	Строки.НаправлениеДеятельности КАК НаправлениеДеятельностиДт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеДт,
	|
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетДт,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыЗатратРегл.МатериальныеЗатраты) КАК СубконтоДт1,
	|	Стоимости.КорНоменклатура КАК СубконтоДт2,
	|	Строки.ГруппаПродукции КАК СубконтоДт3,
	|	
	|	0 КАК ВалютнаяСуммаДт,
	|	0 КАК КоличествоДт,
	|	0 КАК СуммаНУДт,
	|	0 КАК СуммаПРДт,
	|	0 КАК СуммаВРДт,
	|	
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчетаКт,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаУчетаКт,
	|	Стоимости.Склад КАК МестоУчетаКт,
	|
	|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)	КАК ВалютаКт,
	|	Операция.Подразделение КАК ПодразделениеКт,
	|	Стоимости.КорНаправлениеДеятельности КАК НаправлениеДеятельностиКт,
	|	НЕОПРЕДЕЛЕНО КАК НалоговоеНазначениеКт,
	|
	|	НЕОПРЕДЕЛЕНО					КАК СчетКт,
	|	НЕОПРЕДЕЛЕНО					КАК СубконтоКт1,
	|	НЕОПРЕДЕЛЕНО					КАК СубконтоКт2,
	|	Строки.КорГруппаПродукции		КАК СубконтоКт3,
	|
	|	0 КАК ВалютнаяСуммаКт,
	|	0 КАК КоличествоКт,
	|	0 КАК СуммаНУКт,
	|	0 КАК СуммаПРКт,
	|	0 КАК СуммаВРКт,
 	|	""%1"" КАК Содержание
	|
	|ИЗ 
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ПоступлениеОтПереработчика КАК Операция
	|	ПО
	|		ДокументыКОтражению.Ссылка = Операция.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтроки КАК Строки
	|	ПО
	|		Строки.Ссылка = Операция.Ссылка
	|		И Строки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И Строки.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|		И Строки.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ВтСтоимости КАК Стоимости
	|	ПО
	|		Строки.Ссылка = Стоимости.Ссылка
	|		И Строки.Номенклатура			 = Стоимости.Номенклатура
	|		И Строки.Склад					 = Стоимости.Склад
	|		И Строки.ГруппаФинансовогоУчета	 = Стоимости.ГруппаФинансовогоУчета
	|		И Строки.НаправлениеДеятельности = Стоимости.НаправлениеДеятельности
	|		И Строки.РазделУчета 			 = Стоимости.РазделУчета,
	|
	|	Константа.ПартионныйУчетВерсии22 КАК ПУ22,
	|	Константа.ДатаПереходаНаПартионныйУчетВерсии22 КАК ДатаПерехода
	|
	|ГДЕ
	|	Строки.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|	И (ДатаПерехода.Значение <> ДАТАВРЕМЯ(1, 1, 1)
	|			И ДатаПерехода.Значение > Операция.Дата
	|		ИЛИ ДатаПерехода.Значение = ДАТАВРЕМЯ(1, 1, 1)
	|			И НЕ ПУ22.Значение)
	|	И (Строки.ГруппаПродукции <> Строки.КорГруппаПродукции
	|	ИЛИ Строки.НаправлениеДеятельности <> Строки.КорНаправлениеДеятельности)
	|";   
 
 	ТекстОтраженияПереквалификацииВозвратныхОтходов = СтрШаблон(ТекстОтраженияПереквалификацииВозвратныхОтходов, 
 		НСтр("ru='Изменение аналитики';uk='Зміна аналітики'",ЯзыкСодержания));
 
#КонецОбласти


	ТекстыОтражения = Новый Массив;
	ТекстыОтражения.Добавить(ТекстОтраженияПоступлениеСобственныхТоваровПервичные21);
	ТекстыОтражения.Добавить(ТекстОтраженияПоступлениеСобственныхТоваровПервичные);
	ТекстыОтражения.Добавить(ТекстОтраженияПоступлениеСобственныхТоваровРасчетные);
	ТекстыОтражения.Добавить(ТекстОтраженияПоступлениеСобственныхТоваровСкладПроизводства);
	ТекстыОтражения.Добавить(ТекстОтраженияПоступлениеТоваровНематериальныеЗатраты);
	ТекстыОтражения.Добавить(ТекстОтраженияПоступлениеТоваровДавальца);
	ТекстыОтражения.Добавить(ТекстОтраженияУслугиПереработчика);
	ТекстыОтражения.Добавить(ТекстОтраженияПереквалификацииВозвратныхОтходов);
	Возврат СтрСоединить(ТекстыОтражения, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	//-- Локализация
	Возврат "";
	
КонецФункции

// Функция возвращает текст запроса дополнительных временных таблиц,
// необходимых для отражения в регламентированном учете
//
// Возвращаемое значение:
//   Строка - сформированный текст запроса.
//
Функция ТекстЗапросаВТОтраженияВРеглУчетеУКР() Экспорт
	
	//++ Локализация

	Возврат "
	|////////////////////////////////////////////////////////////////////////////////
	|// Формирование временной таблицы нематериальных затрат
	|ВЫБРАТЬ
	|	ПрочиеРасходыНезавершенногоПроизводства.Регистратор КАК Ссылка,
	|	ПрочиеРасходыНезавершенногоПроизводства.Период КАК Период,
	|	ПрочиеРасходыНезавершенногоПроизводства.Организация,
	|	ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура КАК Продукция,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура.ГруппаФинансовогоУчета
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА ЕСТЬNULL(ПрочиеРасходыНезавершенногоПроизводства.ВидЗапасов.ГруппаФинансовогоУчета,
	|					ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка))
	|		ИНАЧЕ ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности, ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК НаправлениеДеятельности,
	|	ЕСТЬNULL(ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Назначение.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)) КАК КорНаправлениеДеятельности,
	|	ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.МестоХранения КАК МестоУчетаДт,
	|	ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.СкладскаяТерритория.Подразделение КАК ПодразделениеДт,
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение КАК ПодразделениеКт,
	|	ПрочиеРасходыНезавершенногоПроизводства.ГруппаПродукции КАК ГруппаПродукцииКт,
	|	СУММА(ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРегл) КАК Сумма,
	|	СУММА(ПрочиеРасходыНезавершенногоПроизводства.СтоимостьУпр) КАК СуммаУпр
	|ПОМЕСТИТЬ НематериальныеЗатраты
	|ИЗ
	|	ДокументыКОтражению КАК ДокументыКОтражению
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНезавершенногоПроизводства
	|			ПО ДокументыКОтражению.Ссылка = ПрочиеРасходыНезавершенногоПроизводства.Регистратор
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеОтПереработчика КАК Операция
	|			ПО ДокументыКОтражению.Ссылка = Операция.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|			ПО СпрПартииПроизводства.Ссылка = ПрочиеРасходыНезавершенногоПроизводства.ПартияПроизводства
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|			ПО ИСТИНА
	|
	|ГДЕ
	|	ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
	|	ПрочиеРасходыНезавершенногоПроизводства.Период,
	|	ПрочиеРасходыНезавершенногоПроизводства.Организация,
	|	ПрочиеРасходыНезавершенногоПроизводства.ГруппаПродукции,
	|	ПрочиеРасходыНезавершенногоПроизводства.Регистратор,
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|			ТОГДА ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура.ГруппаФинансовогоУчета
	|		КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета
	|			ТОГДА ЕСТЬNULL(ПрочиеРасходыНезавершенногоПроизводства.ВидЗапасов.ГруппаФинансовогоУчета,
	|					ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка))
	|		ИНАЧЕ ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ,
	|	ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура,
	|	ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.МестоХранения,
	|	ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.СкладскаяТерритория,
	|	ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Номенклатура.ГруппаАналитическогоУчета,
	|	СпрПартииПроизводства.НаправлениеДеятельности,
	|	ЕСТЬNULL(ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции.Назначение.НаправлениеДеятельности,
	|		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|;
	|";

	//-- Локализация
	Возврат "";
	
КонецФункции

#КонецОбласти
//-- НЕ УТ


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	//++ Локализация
	РеглУчетПроведениеСервер.ТекстЗапросаТаблицаОтражениеДокументовВРеглУчете(Запрос, ТекстыЗапроса, Регистры);
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
